Revit 2024 API
IFCAggregateIterator Members
The IFCAggregateIterator type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the IFCAggregateIterator
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
MoveNext
 Increments the iterator to the next object in the IFCAggregate.
Reset
 Resets the iterator to the beginning of the aggregate.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
Current
Gets the item at the current position of the iterator.
CurrentObject
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
IFCAggregateIterator Class
Autodesk.Revit.DB.IFC Namespace